examples/address_book/app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("age", "created_at", "homepage", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["age", 18], ["created_at", Mon, 20 May 2013 11:42:20 UTC +00:00], ["homepage", "MyString"], ["name", "MyString"], ["updated_at", Mon, 20 May 2013 11:42:20 UTC +00:00]]
---
  def create
    @contact = Contact.new(params[:contact])

    respond_to do |format|
      if @contact.save

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", "980190962"]]
UPDATE "contacts" SET "age" = 19, "updated_at" = '2013-05-20 11:42:20.920589' WHERE "contacts"."id" = 980190962
---
  def update
    @contact = Contact.find(params[:id])

    respond_to do |format|
      if @contact.update_attributes(params[:contact])